import React from "react"
import Header from '../components/Header';
import Footer from '../components/Footer';
import MainBottom from '../components/MainBottom';
import useScrollToTop from '../hooks/useScrollToTop';
import '../css/help.css';
import { Link } from 'react-router-dom'
import { useState } from 'react';

export default function Help() {
  useScrollToTop();

  const [isVisible1, setIsVisible1] = useState(false);
  const [isVisible2, setIsVisible2] = useState(false);
  const [isVisible3, setIsVisible3] = useState(false);

  const [isClicked1, setIsClicked1] = useState(false);
  const [isClicked2, setIsClicked2] = useState(false);
  const [isClicked3, setIsClicked3] = useState(false);

  const toggleVisibility1 = () => {
    setIsVisible1(!isVisible1);
  };

  const toggleVisibility2 = () => {
    setIsVisible2(!isVisible2);
  };

  const toggleVisibility3 = () => {
    setIsVisible3(!isVisible3);
  };

  
  const toggleButtonColor1 = () => {
    toggleVisibility1();
    setIsClicked1(!isClicked1);
  };
  const toggleButtonColor2 = () => {
    toggleVisibility2();
    setIsClicked2(!isClicked2);
  };
  const toggleButtonColor3 = () => {
    toggleVisibility3();
    setIsClicked3(!isClicked3);
  };

  return(
    <div>
      <Header variant="homepage" />
      <div className="help-split">
        <div className="article-text">
            <br></br>
            <h2>Πως μπορούμε να σας βοηθήσουμε;</h2>
            <br></br>
            <div className="icon-text">
                <img src="/arrow_right.png" alt="icon1" className="icon" />
                <p><Link to="/help_center" className="link">Αναζητώ εργασία</Link></p>
            </div>
            
            <div className="icon-text">
                <img src="/arrow_right.png" alt="icon1" className="icon" />
                <p><Link to="/help_center_for_employers" className="link">Είμαι εργοδότης</Link></p>
            </div>

        </div>
        <div className="article-text">
            <h1>Κέντρο Βοήθειας για τα άτομα που αναζητούν εργασία</h1>
            <div className="toggle-buttons">
                <button className={`toggle-button ${isClicked1 ? 'clicked' : ''}`}
                    onClick={toggleButtonColor1}>Πως μπορώ να επεξεργαστώ τα προσωπικά μου στοιχεία;</button>
                {isVisible1 && 
                    <div className="frame">
                        Αν θέλετε να επαναφέρετε τον κωδικό πρόσβασής σας, επισκεφτείτε τον σύνδεσμο Είσοδος στην επάνω δεξιά γωνία οποιασδήποτε σελίδας του Indeed.Κάντε κλικ στην επιλογή Ξεχάσατε τον κωδικό πρόσβασης; κάτω από το πλαίσιο σύνδεσης, εισαγάγετε τη διεύθυνση email που συσχετίζεται με τον λογαριασμό σας στο Indeed και κάντε κλικ στην επιλογή Υποβολή. Ελέγξτε τον φάκελο ανεπιθύμητης αλληλογραφία, αν δεν δείτε το email στα εισερχόμενά σας.Αν δημιουργήσατε κατά λάθος έναν λογαριασμό Indeed με ένα τυπογραφικό λάθος στο email σας ή αν δεν έχετε πλέον πρόσβαση στη διεύθυνση email, δυστυχώς, δεν θα μπορείτε να ανακτήσετε τον κωδικό πρόσβασης για τον λογαριασμό και θα χρειαστεί να δημιουργήσετε έναν νέο λογαριασμό.
                    </div>}
                <br></br>
                <button className={`toggle-button ${isClicked2 ? 'clicked' : ''}`}
                    onClick={toggleButtonColor2}>Έναρξη συζήτησης με άλλον επαγγελματία</button>
                {isVisible2 && 
                    <div className="frame">
                        Η χρήση του Indeed είναι ίδια με τη χρήση κάθε μηχανής αναζήτησης, όπως το Google. Μπορείτε να πραγματοποιήσετε γρήγορη αναζήτηση από την αρχική σελίδα του Indeed με τον εξής τρόπο:
                        <ol>
                        <li>Στο πλαίσιο τι πληκτρολογήστε μια περιγραφή του είδους εργασίας που αναζητάτε - όπως τίτλο εργασίας, ικανότητα ή όνομα εργοδότη.</li>
                        <li>Στο πλαίσιο που πληκτρολογήστε την πόλη, την πολιτεία ή την περιοχή στην οποία θέλετε να βρείτε εργασία.</li>
                        <li>Πατήστε Εύρεση θέσεων εργασίας ή πατήστε Enter στο πληκτρολόγιό σας.</li>
                        </ol>
                        Θα λάβετε ως επιστροφή εργασίες που αντιστοιχούν στις λέξεις κλειδιά που καταχωρήσατε, εντός απόστασης 25 χιλιομέτρων από την τοποθεσία που καθορίσατε. Εάν καταχωρίσετε δύο ή περισσότερες λέξεις κλειδιά, θα επιστραφούν μόνο οι θέσεις εργασίας που περιέχουν όλες τις λέξεις της αναζήτησής σας.

                    </div>}
                <br></br>
                <button className={`toggle-button ${isClicked3 ? 'clicked' : ''}`}
                    onClick={toggleButtonColor3}>Πώς μπορώ να κάνω αίτηση για μια θέση εργασίας στο CareerHive;</button>
                {isVisible3 && 
                <div className="frame">
                    Είμαστε πολύ χαρούμενοι που επιλέξατε να χρησιμοποιήσετε το Indeed, για να σας βοηθήσει με την αναζήτηση θέσεων εργασίας! Λάβετε υπόψη ότι το Indeed δεν λειτουργεί ως υπηρεσία εύρεσης υποψηφίων, αλλά ως μηχανή αναζήτησης θέσεων εργασίας.Για να κάνετε αίτηση για θέσεις εργασίας στο Indeed, πρώτα επισκεφτείτε την αρχική σελίδα μας. Εκεί θα βρείτε δύο πλαίσια κειμένου με τις υποδείξεις Τι και Πού. Στο πλαίσιο Τι, μπορείτε να πληκτρολογήσετε τις επιθυμητές λέξεις-κλειδιά που σχετίζονται με τον τύπο θέσης εργασίας που αναζητάτε, το όνομα μιας εταιρείας ή τον κλάδο στον οποίο θα θέλατε να εργαστείτε. Για να βρείτε τη θέση εργασίας που επιθυμείτε σε μια συγκεκριμένη περιοχή, πληκτρολογήστε την πόλη, την περιφέρεια ή τον ταχυδρομικό κώδικα στο πλαίσιο Πού. Αφού διαμορφώσετε την αναζήτησή σας, κάντε κλικ στο κουμπί Εύρεση θέσεων εργασίας.Υπάρχουν δύο διαφορετικοί τύποι θέσεων εργασίας στο Indeed: εκείνες για τις οποίες μπορείτε να χρησιμοποιήσετε τη δυνατότητα «Κάντε αίτηση εύκολα», κάνοντας κλικ στην επιλογή «Αίτηση τώρα», και εκείνες που σας ανακατευθύνουν στον ιστότοπο της εταιρείας που πραγματοποιεί την πρόσληψη μέσω του κουμπιού «Αίτηση στον εταιρικό ιστότοπο». Οι τελευταίες θα σας μεταφέρουν εκτός του ιστότοπου της Indeed. Έχετε υπόψη σας ότι αυτές οι αιτήσεις μπορεί να είναι λίγο πιο σύνθετες, επομένως, αν έχετε απορίες, θα πρέπει να επικοινωνήσετε με την εταιρεία απευθείας, καθώς το βιογραφικό σας θα υποβληθεί απευθείας μέσω του ιστότοπού της.Όταν κάνετε αίτηση για θέσεις εργασίας στο Indeed, έχετε την επιλογή να χρησιμοποιήσετε το δικό σας αρχείο βιογραφικού. Κατανοούμε ότι μπορεί να έχετε αφιερώσει χρόνο για να τελειοποιήσετε το βιογραφικό σας, επομένως, αν θέλετε να κάνετε αίτηση για θέσεις εργασίας χρησιμοποιώντας το δικό σας πρωτότυπο αρχείο βιογραφικού, μπορείτε να το κάνετε επιλέγοντας «Αίτηση με διαφορετικό βιογραφικό», κάθε φορά που εμφανίζεται ένα παράθυρο για αίτηση. Σε περιπτώσεις που ανακατευθύνεστε στον ιστότοπο του εργοδότη, μπορείτε να το ανεβάσετε εκεί.Αν δεν είστε έτοιμοι να κάνετε αίτηση για μια συγκεκριμένη θέση, έχετε την επιλογή να την αποθηκεύσετε πρώτα. Από την αρχική σελίδα μας, μπορείτε να αποθηκεύσετε μια θέση εργασίας κάνοντας κλικ στις τρεις κάθετες τελείες στην επάνω δεξιά γωνία της καταχώρισης θέσης εργασίας και επιλέγοντας «Αποθήκευση θέσης εργασίας». Αν ανοίξετε μια καταχώριση θέσης εργασίας σε νέα καρτέλα ή νέο παράθυρο, θα εμφανιστεί επίσης το κουμπί «Αποθήκευση αυτής της θέσης εργασίας». Έχετε υπόψη ότι, προκειμένου να αποθηκεύσετε θέσεις εργασίας, θα πρέπει να έχετε συνδεθεί. Αν διαθέτετε λογαριασμό Indeed, θα μπορείτε να δείτε τις αποθηκευμένες θέσεις εργασίας στην ενότητα Οι θέσεις εργασίας μου.
                <br></br>Καλή επιτυχία στην αναζήτηση θέσεων εργασίας!
                </div>}
            </div>
        </div>
      </div>
      <MainBottom />
      <Footer />
    </div>
  )
}
