import React from "react"
import Header from '../components/Header';
import Footer from '../components/Footer';
import MainBottom from '../components/MainBottom';
import useScrollToTop from '../hooks/useScrollToTop';
import '../css/help.css';

export default function Pripolicy() {
  useScrollToTop();
  return(
    <div>
      <Header variant="homepage" />
      <div className="article-container">

      
      <div className="article-text">
        <h1>Το απόρρητό σας έχει σημασία</h1>
        <h2>Η Πολιτική Απορρήτου μας ενημερώνεται κάθε μήνα.</h2>
        <p>Η αποστολή του CareerHive είναι να συνδέσει τους επαγγελματίες του κόσμου για να τους επιτρέψει να είναι πιο παραγωγικοί και επιτυχημένοι. Κεντρικό στοιχείο αυτής της αποστολής είναι η δέσμευσή μας να είμαστε διαφανείς σχετικά με τα δεδομένα που συλλέγουμε για εσάς, τον τρόπο χρήσης και με ποιους μοιράζονται.</p>
        <br></br>
        <h2>Τα δεδομένα που συλλέγουμε</h2>
        <p>Για να δημιουργήσετε έναν λογαριασμό, πρέπει να παρέχετε δεδομένα, όπως το όνομά σας, τη διεύθυνση email ή/και τον αριθμό του κινητού σας τηλεφώνου, τη γενική τοποθεσία (π.χ. πόλη) και έναν κωδικό πρόσβασης.</p>
        <p>Έχετε επιλογές σχετικά με τις πληροφορίες στο προφίλ σας, όπως την εκπαίδευση, την εργασιακή εμπειρία, τις δεξιότητές σας, τη φωτογραφία, την πόλη ή την περιοχή και τις εγκρίσεις σας. Δεν χρειάζεται να παρέχετε πρόσθετες πληροφορίες στο προφίλ σας. Ωστόσο, οι πληροφορίες προφίλ σάς βοηθούν να αξιοποιήσετε περισσότερα από τις Υπηρεσίες μας, συμπεριλαμβανομένης της βοήθειας σε υπεύθυνους προσλήψεων και επιχειρηματικών ευκαιριών να σας βρουν. Είναι δική σας επιλογή αν θα συμπεριλάβετε ευαίσθητες πληροφορίες στο προφίλ σας και θα τις δημοσιοποιήσετε. Μην δημοσιεύετε ή προσθέτετε προσωπικά δεδομένα στο προφίλ σας που δεν θα θέλατε να είναι δημόσια διαθέσιμα.</p>
        <p>Εσείς και άλλοι ενδέχεται να δημοσιεύετε περιεχόμενο που περιλαμβάνει πληροφορίες για εσάς (ως μέρος άρθρων, αναρτήσεων, σχολίων, βίντεο) στις Υπηρεσίες μας. Ενδέχεται επίσης να συλλέξουμε δημόσιες πληροφορίες για εσάς, όπως επαγγελματικές ειδήσεις και επιτεύγματα, και να τις διαθέσουμε ως μέρος των Υπηρεσιών μας, συμπεριλαμβανομένων, όπως επιτρέπεται από τις ρυθμίσεις σας, σε ειδοποιήσεις προς άλλους για αναφορές στις ειδήσεις.</p>
        <h2>Πώς χρησιμοποιούμε τα δεδομένα σας</h2>
        <p>Ο τρόπος με τον οποίο χρησιμοποιούμε τα προσωπικά σας δεδομένα θα εξαρτηθεί από τις Υπηρεσίες που χρησιμοποιείτε, τον τρόπο χρήσης αυτών των Υπηρεσιών και τις επιλογές που κάνετε στις ρυθμίσεις σας. Χρησιμοποιούμε τα δεδομένα που έχουμε για εσάς για να παρέχουμε και να εξατομικεύσουμε τις Υπηρεσίες μας, μεταξύ άλλων με τη βοήθεια αυτοματοποιημένων συστημάτων και συμπερασμάτων που κάνουμε, έτσι ώστε οι Υπηρεσίες μας (συμπεριλαμβανομένων των διαφημίσεων) να είναι πιο σχετικές και χρήσιμες για εσάς και τους άλλους.</p>
        <p>Οι Υπηρεσίες μας σάς επιτρέπουν να παραμένετε σε επαφή και να ενημερώνεστε με συναδέλφους, συνεργάτες, πελάτες και άλλες επαγγελματικές επαφές. Για να το κάνετε αυτό, μπορείτε να «συνδεθείτε» με τους επαγγελματίες που επιλέγετε και που επιθυμούν επίσης να «συνδεθούν» μαζί σας. Ανάλογα με τις ρυθμίσεις σας και τις ρυθμίσεις τους, όταν συνδέεστε με άλλα Μέλη, θα μπορείτε να αναζητάτε ο ένας τις συνδέσεις του άλλου προκειμένου να ανταλλάσσετε επαγγελματικές ευκαιρίες.</p>
      </div>
    </div>
      <MainBottom />
      <Footer />
    </div>
  )
}
